package threeday;

public class 자바_스프링_스프링부트 {
    /*
    1. Java - 1995년
    선 마이크로시스템즈가 만든 프로그래밍 언어

        Sun 이 기본 자바 언어만으로는 DB 연결 트랜잭션 보안 등을 작업하는데
        수작업으로 해야할 것이 너무 많다!!!!
        Servlet / JSP(1997) - 웹 요청을 처리하는 표준 규칙
            doGet doPost 가 여기서 정의되었고
            서블릿만 쓰면 코드가 너무 지저분해진다.
            결과를 내놓기 위해서 부가적으로 환경설정 해야할 것이 너무 많았다.

        Sun은 DB연결과 같은 복잡함을 해결하기 위해서 EJB 기술 내놨지만
        오히려 더 복잡하고 힘들어서 개발자들이 욕했다.

     2. Spring - 2003~2004 EJB의 대안으로 등장
        Rod Johnson 사람이 EJB의 복잡을 해결하기 위해 만든 프레임워크
        @ 어노테이션을 사용해서 복잡함을 해결했지만
        XML 설정 파일을 엄청 많이 작성해야 했다.

     3. Spring Boot - 2014년 Spring 의 설정 지옥을 해결
        Pivotal 회사의 스프링 개발팀이 만든 것
        Spring 이 너무 좋은데 여기에 환경설정만 쉽게 해주면 좋지 않을까?
        문제를 해결하려고 만들어진 Spring 위에 얹은 또 하나의 도구

     자바는 썬 마이크로시스템즈 라는 회사에서 만들었다.
     → 2010년 오라클이 썬 마이크로시스템즈 회사를 인수
     Sun이 가지고 있는 모든 것이 Oracle 소유로 변경

     */
}
